# -*- coding: utf-8 -*-
"""задания модуль 1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1uO_LKdq5s0fRCu0e9zfqWGKdEhO_EnYe

## Задача 1

Создайте переменную a = 10, возвести значение в 3 степень и найти остаток от деления на 3.
"""

a = 10**3%3

"""## Задача 2

Найдите площадь круга с радиусом 1.23456.

(Считаем π = 3.14)
"""

print(3.14*1.23456**2)

"""## Задача 3

Найдите, истинно ли, что 2 в 10 степени больше 1000 при условии, что 4 в 7й степени меньше 8 в 5й.
"""

print((2**10 > 1000)and(4**7 < 8**5))

"""## Задача 4

Мы принимаем целое число на ввод с клавиатуры (код предоставлен), вывести "цена выше рынка", если число выше 1200, "цена ниже рыночной", если число меньше 800 и "все ок" в остальных случаях.
"""

price = int(input('Введите цену товара: '))
print(["все ок","цена выше рынка"][price>1200])

"""## Задача 5

Распечатайте с 4 по 8 символ фразы "Привет мир!" приведенные к верхнему регистру.
"""

print("Привет мир!"[4:8].upper())

"""## Задача 6

Создайте переменную, которая хранит описание этой задачи как строку, разделите слова по пробелам и приведите к нижнему регистру.
"""

l = "Создайте переменную, которая хранит описание этой задачи как строку, разделите слова по пробелам и приведите к нижнему регистру."
l = l.lower().split(" ")
print(l)

"""## Задание 7

Напишите код, который проверяет, является ли переменная x строкой, и если да, то если в строке больше одного слова (слово--последовательность подряд идущих символов без пробелов), то выводит на экран количество слов в этой строке и сами слова в алфавитном порядке.
"""

x = 'z hello world'
if type(x) == str:
  x = sorted(x.split(" "))
  l = len(x)
  if l > 1:
    print(l, *x, sep='\n')

"""## Задание 8

Напишите код, который все элементы массива x с **нечетными** индексами переставит в обратном порядке.

Т.е. если x = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9], то код должен получать [0, 9, 2, 7, 4, 5, 6, 3, 8, 1]
"""

x = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
n = len(x)
for i in range(1, n//2, 2):
  x [i], x[n-i] = x[n-i], x[i]
print(x)

"""## Задание 9

Напишите цикл, который выводит все числа от 0 до 500, делящиеся на 7, если в них есть цифра 8.

*Подсказка*: переменную типа int можно привести к типу str:
```
x = 5
y = str(x)
```
"""

for i in range(489):
  if i%7==0 and '8' in str(i):
    print(i)